tutorials/dbsFoam/simpleFirstOrderKineticMole/poreScaleCalciteDissolution/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// unit : length = m ; mole = mol ; time = s ; weight = kg


transportModel  Newtonian;

nu 		nu [ 0 2 -1 0 0 0 0 ] 1e-6;


geochemicalProperties
{
	geochemicalModel simpleFirstOrderKineticMole; 


	rhol    rhol [ 1 -3 0 0 0 0 0 ] 1000;


	mineral (Calcite);

	CalciteProperties
	{

		surfaceAreaModel volumeOfSolid;

		Vm     Vm   [ 0 3 0 0 -1 0 0 ] 36.9e-6;		// 36.9 cm3/mol
		ki     ki   [0 -2 -1 0 1 0 0] -8.9e-1; 		//

		Acti   Acti [0 3 0 0 -1 0 0] 1e-3;
		//M      M    [1 0 0 0 -1 0 0] 1e-1;
		rhos   rhos [ 1 -3 0 0 0 0 0 ] 2710;
	}



	absolutePermeabilityModel KozenyCarman;
	KozenyCarmanCoeffs
	{
		K0              K0 [ 0 2 0 0 0 0 0 ] 1e-11;
		updateFromInitialValue off;
	}

	dispersionModel archiesLaw;
	archiesLawCoeffs
	{
		Di   		Di  [0 2 -1 0 0 0 0] 1e-9;
		n 2;	
	}

}






// ************************************************************************* //
