tutorials/dbsFoam/simpleFirstOrderKineticMole/poreScaleCalciteDissolution/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

valueAlpha 0.99; //0.9999;


defaultFieldValues
(
    volScalarFieldValue Ys.Calcite 0//0.9999
    volScalarFieldValue Ci 0 // 1e-2 //0.9999
);



regions
(
    cylinderToCell
    {
        p1       (0 0 -10); // start point on cylinder axis
        p2       (0 0 10);   // end point on cylinder axis
        radius   1e-4;
  
        fieldValues
        (
            volScalarFieldValue Ys.Calcite 0.999
    		//volScalarFieldValue Ci 0 //0.9999
        );
    }
);

// ************************************************************************* //
